package gr.odikapoulia.greekbirds;

/**
 * Created by nikos on 1/3/18.
 */

public class QueryInsert {

    String query;
    public String QueryInsert(){

        query = "INSERT INTO birdlist (Birdname,BirdInfo, Photo, Result) VALUES " +
        "('Καρδερίνα','<strong>Επιστημονική Ονομασία:</strong><br/>Carduelis carduelis<br/><strong>Κατανομή</strong>:<br/>Ευρώπη, Βόρεια Αφρική και Δυτική Ασία.<br/><strong>Διατροφή</strong>:<br/>Τρέφεται σχεδόν αποκλειστικά με σπόρους κυρίως αγκαθιών και με σκουλήκια.<strong> Μήκος</strong>: 19 εκατοστά.<br/><strong>Βιότοπος</strong>: Δάση και λιβάδια, όπως επίσης σε κήπους και σε αγρούς.<br/><strong>Επώαση</strong>: \"Με την άνθιση της αμυγδαλιάς\" η καρδερίνα κτίζει φωλιά συνήθως σε κορυφές δέντρων όπου γεννά 4-5 αυγά χρώματος γαλαζοπράσινου με καστανά στίγματα και τα επωάζει επί 14 ημέρες.<br/><strong>Κοινωνική δομή:</strong> μικρά ή μεγάλα σμήνη.<br/><strong>Διάκριση φύλου:</strong><br/><strong> Σημάδι πρώτο η μάσκα της καρδερίνας.</strong> Στα αρσενικά πουλιά η <strong>μάσκα</strong> περνάει εμφανώς πίσω από το μάτι ενώ στα θηλυκά είναι στα όρια ή <strong>πίσω από το μάτι</strong>. Κάτω από το ράμφος καλύπτει περισσότερο μέρος στα αρσενικά από ότι στα θηλυκά.<br/><strong>Σημάδι δεύτερο</strong> το σημείο που ενώνεται το φτερό με το σώμα. Στα αρσενικά το φτερό είναι <strong>μαύρο</strong> ενώ στα θηλυκά είναι <strong>καφέ</strong> ή έχει και καφέ φτερά.<br/><strong>Σημάδι τρίτο</strong> τα πούπουλα που υπάρχουν στην ρίζα του ράμφους τα γνωστά <strong>μουστάκια</strong>. Τα αρσενικά έχουν <strong>μαύρα</strong> <strong>μουστάκια</strong> ενώ τα <strong>θηλυκά καφέ</strong>.<br/><strong>Σημάδι τέταρτο</strong>, ο «<strong>σταυρός</strong>» πίσω από το κεφάλι. Στα θηλυκά πουλιά ο σταυρός είναι πολύ πιο αχνός από τα αρσενικά.<br/><strong>Σημάδι πέμπτο</strong>, γεννητικά όργανα.<br/>Ιδιαίτερα την άνοιξη είναι πιο εύκολη η αναγνώριση από τα γεννητικά όργανα αλλά σε ενήλικα πουλιά και από πεπειραμένο εκτροφέα, στα αρσενικά σχηματίζει σχεδόν ορθή γωνία ενώ στα θηλυκά γέρνει ελαφρώς προς την ουρά.<br/><strong>Λοιπά σημάδια.</strong><br/>Οι αρσενικές καρδερίνες έχουν <strong>πιο μεγάλο κίτρινο μέρος στα φτερά από τις θηλυκές</strong>. Στο στήθος και κάτω από τα φτερά υπάρχουν στις αρσενικές κίτρινα πούπουλα .<br/>Έχει παρατηρηθεί ότι τα περισσότερα αρσενικά έχουν πολύ <strong>πιο μακριά ράμφη από τα θηλυκά.</strong><br/>Τέλος για πολύ έμπειρο μάτι είναι<strong> η γραμμή του ράμφους</strong> (που σχηματίζεται από τις δύο «γνάθους») στα αρσενικά η νοητή ευθεία<strong> διχοτομεί το μάτι</strong> ενώ στα θηλυκά εφάπτεται στο κάτω μέρος.<br/>Στα <strong>νεαρά</strong> <strong>πτηνά</strong> πριν κλείσουν σχεδόν μισό χρόνο ζωής είναι πάρα πολύ δύσκολο να διακρίνουμε το φύλο τους διότι είναι «<strong>άβαφα</strong>». Εκεί ανάλογα και πάντα με την ηλικία τους προσπαθούμε να διαπιστώσουμε αν ισχύει κάτι από τους παραπάνω κανόνες και <strong>ιδιαίτερα με τα πούπουλα στη βάση του ράμφους που τα αρσενικά έχουν μαύρα (μαυρομούστακα) ενώ τα θηλυκά καφέ.</strong> Επίσης η συμπεριφορά του πουλιού και το στήσιμο μας προδίδει τι είναι.<br/>Ένας<strong> άτυπος κανόνας είναι και με την σειρά που γεννήθηκαν.</strong> Το πρώτο πουλί είναι σχεδόν πάντα αρσενικό ενώ το τελευταίο (φίντα όπως τη λέγαν οι παλιότεροι) θηλυκό.\n" +
                "Μερικά θηλυκά έχουν πολλά από τα χρωματικά χαρακτηριστικά που έχουν τα αρσενικά (γύφτισσα), ποτέ όμως όλα και είναι αυτά που μας μπερδεύουν τις περισσότερες φορές.<br/><strong>Άλλες ονομασίες:</strong><br/>Η επιστημονική της ονομασία είναι σπίζα η ακανθοφάγος ή ακανθυλίδα η γνήσια.<br/>Αστραγαλίνος ή Στραγαλιάνος ή Στραγαλίνι, Γαρδέλι, Γραμματικούλα , Τουρκοπούλα: ( ή Τουρκάκι στην Λακωνία) από το κόκκινο στο κεφάλι της, που μοιάζει με \"Φέσι\", Σγαρτήλι (Κυπριακή διάλεκτος).<br/><br/><strong>Μεταλλάξεις:</strong><br/><ol>\n" +
                " \t<li><b>Καρδερίνα Major (Carduelis carduelis Major)</b> ή καρδερίνα Σιβηρίας η όποια ωστόσο υστερεί φωνητικά ,</li>\n" +
                " \t<li><b>καρδερίνα Αχάτης</b> ,</li>\n" +
                " \t<li><b>καρδερίνα Ασπροκέφαλη</b> καθώς και *ιζαμπελα.</li>\n" +
                "</ol><br/>Πληροφορίες από:<br/>https://el.wikipedia.org/','karderina','ok')," +
        "('Καναρίνι','<strong>Επιστημονική Ονομασία:</strong><br/>Το καναρίνι είναι <strong>ωδικό πτηνό της τάξης των στρουθιομόρφων </strong>και ανήκει στην οικογένεια των <strong>φριγγιλιδών</strong> (Fringillidae). Η επίσημη ονομασία του<strong> εξημερωμένου καναρινιού είναι sirinus canaria domesticus. </strong><br/><strong>Κατανομή:</strong><br/>Τα καναρίνια <strong>εισήχθησαν στην Ισπανία τον 15ο αι. μετά την κατάκτηση των Κανάριων νήσων από τους Ισπανούς.</strong> Εξαιτίας ενός ναυτιλιακού <strong>ατυχήματος</strong> ένα μεγάλο φορτίο καναρινιών δραπέτευσε και σύντομα <strong>εξαπλώθηκαν σε όλη την Ευρώπη.</strong> Επίσης το καναρίνι<strong> είναι πιθανό να προέρχεται και από το άγριο καναρίνι</strong> (serinus canaria canaria), το οποίο κατάγεται <strong>από τις Κανάριες νήσους Μαδέρα, Αζόρες, Τενερίφη κ.α.</strong><br/><br/><strong>Διατροφή: </strong>Η κύρια τροφή των καναρινιών είναι μια ποικιλία από <strong>ανάμεικτους σπόρους</strong>, <strong>φρούτα και λαχανικά</strong>. Επίσης χρειάζονται συμπλήρωμα τροφής πλούσια σε πρωτεΐνες (αυγοτροφή) με βάση το αυγό.<br/><strong>Βιότοπος: </strong>Κύρια τους κατοικία είναι το αγροτικό περιβάλλον, τα άκρα του δάσους, τόσο στα πεύκα τη δάφνη και τη μυρτιά. Καταλαμβάνουν επίσης περιοχές χαμηλές, ψηλά βουνά, μέτρια φαράγγια, ακόμα και σε πόλεις, φθάνοντας κατά την αναπαραγωγή σε ελαιώνες σε πάρκα και λεωφόρους.<br/><strong>Αναπαραγωγή: </strong>Το θηλυκό γεννάει 3-5 αυγά, που επωάζει για περίπου 14 μέρες.<br/><strong>Χαρακτηριστικά - συμπεριφορά:</strong>Τα καναρίνια είναι καθαρά, ήρεμα και δεν χρειάζονται ιδιαίτερη φροντίδα. Ο μελωδικός και ευχάριστος ήχος που βγάζουν όταν τραγουδάνε είναι το ιδιαίτερο χαρακτηριστικό τους. Από τους πρώτους μήνες της ζωής τους, κυρίως τα αρσενικά, αρχίζουν να κελαηδούν.<br/><strong>Κατηγορίες: </strong>\n" +
                "<ul>\n" +
                " \t<li>Τα ολλανδικά καναρίνια. Είναι μεγάλα, έχουν μαλακό φτέρωμα, αλλά δεν διακρίνοται για το κελάηδημά τους.</li>\n" +
                " \t<li>Τα γερμανικά καναρίνια. Έχουν ωραίο χρώμα και ωραία φωνή.</li>\n" +
                " \t<li>Τα αγγλικά καναρίνια. Έχουν χρώμα κίτρινο σκούρο που μεταβάλλεται όμως σε κιτρινο-κόκκινο ή κοκκινο-πορτοκαλί.</li>\n" +
                "</ul><br/>Πληροφορίες από:<br/>\n" +
                "https://el.wikipedia.org/<br/>','kanarini','ok')," +
        "('Λούγαρο','<strong>Επιστημονική Ονομασία:</strong> <strong>Carduelis spinus και δεν περιλαμβάνει υποείδη.</strong><br/><strong>Κατανομή:</strong> Β. Αμερική, Ασία, Ευρώπη (Γροιλανδία, Ισλανδία), έχει καταγραφεί τόσο στις Αλεούτιες Νήσους, όσο και στον Α. Καναδά. Περιπλανώμενοι επισκέπτες έχουν αναφερθεί μεταξύ άλλων από την Σαουδική Αραβία, το Μπαχρέιν, το Ομάν, το Νεπάλ και το Αφγανιστάν, το Χονγκ Κονγκ και τις Φιλιππίνες!!<br/><strong>Διατροφή: </strong>Ποικιλία από <strong>ανάμεικτους σπόρους</strong>, <strong>φρούτα και λαχανικά</strong>. Επίσης χρειάζονται συμπλήρωμα τροφής πλούσια σε πρωτεΐνες (αυγοτροφή) με βάση το αυγό.<br/><strong>Βιότοπος: </strong>Δεν παραμένει για πολύ σε μια περιοχή, αλλά προτιμάει να εναλλάσσει τα εδάφη που χρησιμοποιούνται για αναπαραγωγή, διατροφή και διαχείμαση, κατά περιόδους. Το κύριο ενδιαίτημα του είδους είναι οι δασικές εκτάσεις<strong> (κωνοφόρα, μικτά δάση) μέχρι ένα συγκεκριμένο υψόμετρο,</strong> κυρίως στις πλαγιές των βουνών, με<strong> ιδιαίτερη προτίμηση για τις υγρές περιοχές</strong> (όχθες ποταμών).Από τα δάση κωνοφόρων, απαντάται ιδιαίτερα σε εκείνα της ερυθρελάτης (Picea abies), για το φώλιασμα. Επίσης άλση, φράκτες, συστάδες σημύδων και σκλήθρων, κατά τη διάρκεια του χειμώνα.<br/><strong>Διάκριση Φύλου: </strong>Το λούγαρο <strong>είναι από τις κομψότερες σπίζες και χαρακτηρίζεται από το όμορφο κιτρινόμαυρο πτέρωμά του.</strong> Παρόλο που μπορεί -από κάποια απόσταση- να συγχέεται με τα συγγενικά του είδη, το αρσενικό ξεχωρίζει εύκολα διότι είναι η μόνη κίτρινη ευρωπαϊκή σπίζα με μαύρο στέμμα και μαύρη κηλίδα στο σαγόνι.<br/>Στο είδος εμφανίζεται φυλετικός διμορφισμός, με το αρσενικό να έχει φωτεινότερα χρώματα από το θηλυκό, ιδιαίτερα στην περιοχή του κεφαλιού.<br/><strong>Το εξαιρετικό κελάηδημά του, καθώς και η ανθεκτικότητά του σε συνθήκες αιχμαλωσίας,</strong> τού έχουν κοστίσει ακριβά, διότι είναι από τα πλέον «αγαπημένα» ωδικά πτηνά που ζουν σε κλουβιά, ιδιαίτερα στην Ελλάδα.<br/><strong>Άλλες Ονομασίες:</strong> Σπίζα η ακανθυλλίς, Σπίζα η πρασίνη, Ακανθυλίς/Ακανθίς η πρασίνη και Ακανθυλλίς/Ακανθίς η χρυσοπράσινη, Λουγαράκι, Λουκαρίνο, Σκαθάρι, Σκαθί, Χρυσοκαρδερίνα, Αηδονάκι, Ζιζικάκι, Κιτρινάκι, Λουβαράκι, Λούβαρο, Λουγαρίνι, Μούλος, Μπαστοκάναρο και Σκαθάκι.<br/>Στην Κύπρο, η συνηθέστερη ονομασία του είναι Θκιολαρούδι.<br/><strong>Σημειωτέον ότι, η λαϊκή ονομασία Σκαθί προέρχεται από την ομοιότητά του με το είδος Serinus serinus δηλαδή το κοινό μας σκαρθί ή οργανέλι και δεν πρέπει να συγχέεται με αυτό.</strong><br/>Πληροφορίες από:\n" +
                "https://el.wikipedia.org/<br/>','lougaro','ok'),('Σκαρθί','<strong>Επιστημονική Ονομασία:</strong> Carduelis spinus και περιλαμβάνει 8 υποείδη.<br/><strong>Κατανομή:  </strong>Ευρώπη και Αφρική.<br/><strong>Διατροφή: </strong>Σπόρους ,έντομα, βλαστάρια και μπουμπούκια.<br/><strong>Μέγεθος</strong>: είναι μικρό πουλί με μήκος 11-12 cm.<br/><strong>Αναπαραγωγή:</strong> Σε δάσος , καλλιεργημένες εκτάσεις, συχνά με ορισμένα κωνοφόρα, ευνοούνται για αναπαραγωγή. Χτίζει τη φωλιά του από θάμνο έως δέντρο, και κάνει 3-5 αυγά. Είναι σε σμήνη εκτός από την εποχή αναπαραγωγής, μερικές φορές αναμιγνύεται με άλλα κοπάδια.<br/><strong>Διάκριση Φύλου: </strong>Το αρσενικό έχει<strong> φωτεινότερο κίτρινο πρόσωπο και στήθος</strong>, περισσότερο κίτρινο στα φτερά και κίτρινο στην ουρά στα πλάγια.<br/><strong>Άλλες Ονομασίες: </strong>Σκαρθάκι, Αγριοκανάρι, Αγριοζίζικο, Εργανέλι, Ουργανέλι, Φριγαδέλι, Φριτζιλίνι, Στρίτσι, Σβουριτζάκι, Σισαμάκι, Ψευτάκι ενώ στην Κύπρο το λένε Μπατσαρτοκανάρινο.<br/>Ζωηρό πουλί με γεμάτο ενέργεια κελάηδημα και πολλές φορές κελαηδάει και όταν πετάει.<br/>  Είναι στενά συνδεδεμένο με το καναρίνι. Η λέξη serin στα γαλλικά σημαίνει καναρίνι. Είναι το μόνο είδος που όταν διασταυρωθεί με το καναρίνι <strong>δίνουν γόνιμους απογόνους.</strong><br/>Πληροφορίες από:<br/>https://en.wikipedia.org/','skarthi','ok')," +
         "('Φλώρος','Είναι ένα <strong>από τα πιο διαδεδομένα</strong> και συνάμα πιο " +
                "<strong>αγαπητά</strong> ωδικά πτηνά σε όλη την ευρωπη και ίσος σε όλη την υφήλιο. " +
                "Ο Φλώρος είναι στρουθιόμορφο πτηνό της οικογενείας των Σπιζιδών, που απαντάται και στον " +
                "ελλαδικό χώρο. Η επιστημονική ονομασία του είδους είναι <strong><i>Chloris chloris</i> </strong>" +
                "και περιλαμβάνει 10 υποείδη.Ο φλώρος είναι <strong>μέσου μεγέθους σπίζα,</strong> μεγαλύτερος " +
                "από το λούγαρο και την καρδερίνα, αλλά μικρότερος από τον σπίνο και τον πύρρουλα. " +
                "Γενικά, <strong>έχει στρουμπουλό παρουσιαστικό</strong>, με εύρωστο κεφάλι και ράμφος. " +
                "Ο φλώρος<strong> είναι από τα πλέον οικεία πτηνά στην χώρα,</strong> αναπαραγόμενος σε όλα τα " +
                "ηπειρωτικά και σε πολλά νησιά του Αιγαίου και του Ιονίου. " +
                "Απαντούν από το επίπεδο της θάλασσας μέχρι τα 1.200 μ., αλλά στην Κρήτη μπορούν να βρεθούν " +
                "μέχρι τα 1.600 μ. Τα βρίσκουμε σε άλση, κήπους, ελαιώνες, αμπέλια, καλλιεργούμενες περιοχές " +
                "στα δασοόρια, σε θαμνότοπους και ποταμιές. Γενικά, φωλιάζουν και σε αστικά περιβάλλοντα, " +
                "έχοντας συνηθίσει την ανθρώπινη παρουσία. Ο Φλώρος απαντά στον ελλαδικό χώρο και με τις " +
                "ονομασίες: Ατσάραντος (Στερεά, Ζάκυνθος), Λιναρίδι και Λιναροπούλι (Κρήτη), Πρασινοπούλα, " +
                "Σπιγγάρι και Σπιγγάριος (Αττική), Φιώρι, Φλώρι και Λουλουδάς (Κύπρος).','floros','ok')," +
         "('Φανέτο','Το<strong> Φανέτο</strong> είναι στρουθιόμορφο πτηνό της οικογενείας των Σπιζιδών " +
                "και είναι γνωστό με τις ονομασίες Κιόρι, Σκαθάρι, Φανέτα, Φαγανέλι ενώ στην Κύπρο είναι γνωστό" +
                " ως Τσακροσγάρτιλο.Είναι ένα μικρόσωμο σε μέγεθος πουλί που το συνολικό του μήκος δεν ξεπερνά" +
                " τα 14 εκατοστά. Σπάνια το συναντά κανείς μόνο του. Ζει σε κοπάδια όλο τον χειμώνα, ενώ κατά" +
                " την αναπαραγωγική περίοδο μένουν πάντα σε ζευγάρια.<br/><br/>Πληροφορίες από:<br/>https://el.wikipedia.org/','faneto','ok')," +
          "('Πετροχελίδονο','Το κοινό πετροχελίδονο, γνωστό επίσης ως μαυροσταχτάρα ή μαυροσταχτούρα, " +
                "ένα συνηθισμένο στην Ελλάδα πουλί, δεν είναι μόνο το ταχύτερο στη Γη, αλλά είναι η" +
                " «Φόρμουλα Ένα των αιθέρων» των πουλιών σε ευθεία πτήση (στις βουτιές είναι ο πετρίτης)." +
                "Παρατηρείται συνεχώς να κυνηγά έντομα στον αέρα, συχνά με χελιδόνια. Ξεχωρίζει από αυτά από το" +
                " σκούρο κάτω μέρος (μόνο ο λαιμός ανοιχτόχρωμος), λίγο μεγαλύτερο μέγεθος, διαφορετικό πέταγμα" +
                " και σχήμα φτερούγων.Ανακηρύχθηκε πλέον επίσημα από τους επιστήμονες ο παγκόσμιος πρωταθλητής " +
                "των αιθέρων, καθώς μπορεί να πετά συνεχόμενα επί δέκα μήνες χωρίς καμία στάση. Και βεβαίως, όλο" +
                " αυτό τον καιρό, κοιμάται και τρώει (έντομα) εν πτήση!" +
                "Ήδη από τη δεκαετία του 1950, οι επιστήμονες υποπτεύονταν ότι κανένα πουλί δεν μπορεί να " +
                "συναγωνισθεί το πετροχελίδονο στο πέταγμα, αλλά μόλις τώρα Σουηδοί ερευνητές κατάφεραν να το " +
                "επιβεβαιώσουν. Είναι πια βέβαιο ότι κανένα πουλί στον κόσμο δεν μπορεί να μείνει τόσο πολύ " +
                "καιρό στον αέρα χωρίς να προσγειωθεί. Καθώς το πετροχελίδονο ζει έως 20 χρόνια, συνολικά " +
                "στη διάρκεια της ζωής του πετά επτά φορές την απόσταση Γης-Σελήνης μετ’ επιστροφής." +
                "Αποδείχθηκε ότι το πετροχελίδονο -που εμφανισιακά μοιάζει με το χελιδόνι, αλλά ανήκουν σε " +
                "διαφορετικές οικογένειες πουλιών- περνά μόνο δύο μήνες του χρόνου στη γη, στη βόρεια Ευρώπη, " +
                "κατά την περίοδο της αναπαραγωγής του." +
                "Τον υπόλοιπο χρόνο πετάει, μεταναστεύοντας κυρίως στην Αφρική. Μερικά πουλιά μπορεί να " +
                "προσγειώνονται για λίγες ώρες κάποιο βράδυ, αλλά και αυτά περνούν το 99,5% του δεκαμήνου στον αέρα." +
                "Άλλα όμως δεν…κλέβουν καθόλου και παραμένουν συνεχώς εν πτήση." +
                "Ερώτημα παραμένει πού βρίσκουν την ενέργεια για τόσο μακρινά ταξίδια και πώς συνδυάζουν την πτήση " +
                "με τον ύπνο. Κάθε μέρα, την αυγή και το δειλινό, για άγνωστο λόγο, τα πετροχελίδονα ανεβαίνουν " +
                "σε μεγάλα ύψη, δύο έως τριών χιλιομέτρων, αλλά την υπόλοιπη μέρα πετάνε πιο χαμηλά. Ένα αγαπημένο " +
                "μέρος συγκέντρωσης αυτών των πουλιών στη μεταναστευτική διαδρομή τους είναι η Λιβερία, όπου κάθε " +
                "χρόνο πολλά εκατομμύρια πετροχελίδονα μαζεύονται για να κυνηγήσουν τερμίτες – " +
                "<br/>ένα μοναδικό θέαμα.<br/><br/>Πληροφορίες από:<br/>https://el.wikipedia.org/','petroxelidono','ok')," +
           "('Αετομάχος','Ωδικό πουλί με συμπεριφορά αρπακτικού, όπως όλοι οι κεφαλάδες. Kαλοκαιρινός επισκέπτης, φωλιάζει σε όλη την ηπειρωτική Ελλάδα και σε ορισμένα νησιά.\n" +
                "        Ο αρσενικός Αετομάχος έχει πυρόξανθο φτέρωμα στη ράχη του ενώ το πρόσωπό του αυλακώνεται από μια φαρδιά και χαρακτηριστική μαύρη λωρίδα. Ο λαιμός, τα μάγουλα και το φρύδι έχουν χρώμα λευκό.\n" +
                "\n" +
                "        Το θηλυκό, σε αντίθεση με τα αρσενικό δεν έχει γκρίζο κεφάλι, ούτε διαθέτει μαύρη μάσκα στο πρόσωπο. Η κορυφή του κεφαλιού είναι κοκκινωπή-καφέ, ενώ ο τράχηλος έχει πιο πολύ καφέ-γκρι χρώμα.\n" +
                "\n" +
                "        Στους αετομάχους εμφανίζεται έντονος φυλετικός διμορφισμός. Επίσης οι χρωματισμοί του πτερώματος διαφέρουν όχι μόνον ανάμεσα στα αρσενικά και τα θηλυκά, αλλά ακόμη και μέσα στο ίδιο φύλο και στον ίδιο αναπαραγωγικό πληθυσμό, εμφανίζοντας αξιοσημείωτη διαφοροποίηση.\n" +
                "\n" +
                "        Θα τον συναντήσουμε σε ανοιχτές περιοχές με θάμνους αλλά και σε ξέφωτα του δάσους, να καραδοκεί όχι μόνο για έντομα αλλά και για ποντίκια, βατράχια και μικρά πουλιά. Γεννάει 5-6 αβγά, τα οποία κλωσάει το θηλυκό επί 13-16 μέρες. Οι νεοσσοί δέχονται τη στοργική φροντίδα του ζευγαριού και κάνουν το πρώτα πετάγματα από τη φωλιά μετά από δύο εβδομάδες.\n" +
                "\n" +
                "        Το χαρακτηριστικό πρόσωπο του αετομάχου, η τόλμη του και, κυρίως η χαρακτηριστική του συνήθεια να «αποθηκεύει» τη λεία του καρφώνοντάς την πάνω σε αιχμηρά αντικείμενα, ανέκαθεν κινούσαν το ενδιαφέρον του επιστημονικού κόσμου και όχι μόνον.\n" +
                "\n" +
                "        Η τεχνική της αναμονής από σταθερό πόστο, κατά κύριο λόγο χρησιμοποιείται για το κυνήγι μικρών θηλαστικών, αλλά και σε έντομα όπως σκαθάρια και ακρίδες. Η επίθεση στο θήραμα πραγματοποιείται στο έδαφος και σε απόσταση 10 μέτρων, περίπου, από το πόστο.\n" +
                "\n" +
                "        Το κυριότερο από τα στοιχεία ηθολογίας του αετομάχου όπως είπαμε προηγουμένως, αποτελεί η ενστικτώδης συνήθειά του να «αποθηκεύει» τη λεία του για τις δύσκολες εποχές, αλλά με έναν πολύ ιδιαίτερο τρόπο: το πουλί καρφώνει στην κυριολεξία το νεκρό θήραμα πάνω σε οποιοδήποτε αιχμηρό υπάρχει στην περιοχή όπου συχνάζει, συνήθως πάνω στα μεγάλα αγκάθια των θάμνων, ή πάνω στις αιχμηρές ακίδες συρματοπλεγμάτων από τους εκεί φράκτες.\n" +
                "\n" +
                "        Στην κατασκευή της φωλιάς συμμετέχουν και τα δύο φύλα, κυρίως όμως το θηλυκό και ολοκληρώνεται μετά από 4-6 ημέρες, περίπου.\n" +
                "\n" +
                "        Οι κυριότεροι θηρευτές της φωλιάς του αετομάχου είναι τα αρπακτικά πτηνά, ιδιαίτερα οι Κορακίδες (κίσσες και καρακάξες), πιο σπάνια κάποια θηλαστικά, όπως γάτες, μουστελίδες και τρωκτικά. Σε σπάνιες περιπτώσεις η φωλιά καταστρέφεται από μυρμήκια.\n" +
                "\n" +
                "        Η IUCN, προς το παρόν κατατάσσει το είδος ως «Ελαχίστης Ανησυχίας» (LC), αλλά σε αρκετά ευρωπαϊκά κράτη το είδος απειλείται, τουλάχιστον ως αναπαραγωγικό πτηνό.\n" +
                "\n" +
                "        Στον ελλαδικό χώρο o Αετομάχος απαντά και με τις ονομασίες: Αητομάχος (Παρνασσός), Δαγκάνι (Λεσίνι Αιτωλίας), " +
                "Δάγκος, Κρεουργός, Λιάρος, Μαυρομμάτης, Μουροχάβης, Κοκκινοραχοκεφαλάς και Μαυροκεφαλάς. Τέλος, στην Κυπρο " +
                "αποκαλείται Στακτοτζεφαλάς.<br/><br/>" +
                "Πληροφορίες από:<br/>https://el.wikipedia.org/','aetomaxos','ok');";

        //('','','','ok')


    return query;

    }

}
