package gr.odikapoulia.greekbirds;

/**
 * Created by nikos on 1/3/18.
 */

public class QueryInsert {

    String query;
    public String QueryInsert(){

        query = "INSERT INTO birdlist (Birdname,BirdInfo, Photo, Result) VALUES " +
        "('Καρδερίνα','Η <b>καρδερίνα</b> είναι στρουθιόμορφο πτηνό, του γένους <i><b>Carduelis</b></i> και ανήκει " +
                "στην <strong>οικογένεια των σπιζιδών</strong>.Είναι ωδικό πτηνό και <strong>ζει κατά σμήνη σε δάση και σε λιβάδια," +
                "</strong> όπως επίσης σε κήπους και σε αγρούς. <br/>Βρίσκεται σε ολόκληρη την Ευρώπη, τη Βόρεια Αφρική και " +
                "τη Δυτική Ασία. Είναι αποδημητικό πουλί και το φθινόπωρο μεταναστεύει σε τόπους με πιο γλυκό κλίμα. " +
                "Τρέφεται σχεδόν αποκλειστικά με <strong>σπόρους</strong> <strong>αγκαθιών</strong> και με <strong>σκουλήκια</strong>." +
                " Αξιοσημείωτη είναι η αλληλεγγύη και η αγάπη που τρέφουν τα πουλιά αυτά μεταξύ τους." +
                "<strong>Πρέπει</strong> να αναφέρουμε ότι στην φύση καταναλώνει πάνω από<strong> εκατό διαφορετικούς " +
                "σπόρους...</strong><br/><br/>Πληροφορίες από:<br/>https://el.wikipedia.org/','karderina','ok')," +
        "('Καναρίνι','Το καναρίνι είναι <strong>ωδικό πτηνό της τάξης των στρουθιομόρφων</strong>" +
                " και ανήκει στην οικογένεια των <strong>φριγγιλιδών</strong> (Fringillidae). <br/>" +
                "Η επίσημη ονομασία του<strong> εξημερωμένου καναρινιού είναι sirinus canaria domesticus." +
                "</strong></b>Τα καναρίνια <strong>εισήχθησαν στην Ισπανία τον 15ο αι. μετά την κατάκτηση των" +
                " Κανάριων νήσων από τους Ισπανούς.</strong> " +
                "Εξαιτίας ενός ναυτιλιακού <strong>ατυχήματος</strong> ένα μεγάλο φορτίο καναρινιών δραπέτευσε" +
                " και σύντομα <strong>εξαπλώθηκαν σε όλη την Ευρώπη.</strong> Επίσης το καναρίνι<strong> είναι" +
                " πιθανό να προέρχεται και από το άγριο καναρίνι</strong> (serinus canaria canaria)," +
                " το οποίο κατάγεται <strong>από τις Κανάριες νήσους Μαδέρα, Αζόρες, Τενερίφη κ.α.</strong><br/>" +
                "Κύρια τους κατοικία είναι το αγροτικό περιβάλλον, τα άκρα του δάσους, τόσο στα πεύκα τη δάφνη" +
                " και τη μυρτιά. Καταλαμβάνουν επίσης περιοχές χαμηλές, ψηλά βουνά, μέτρια φαράγγια, ακόμα και " +
                "σε πόλεις, φθάνοντας κατά την αναπαραγωγή σε ελαιώνες σε πάρκα και λεωφόρους.<br/>Είναι <strong>μη " +
                "αποδημητικό είδος</strong> και ζει σε αγέλη κατά το μεγαλύτερο μέρος του έτους. " +
                "<strong>Εκτός της περιόδου αναπαραγωγής</strong>, που τείνει να αφήνει τις " +
                "<strong>δασικές περιοχές</strong>.<br/><br/>Πληροφορίες από:<br/>https://el.wikipedia.org/','kanarini','ok')," +
        "('Λούγαρο','Το <strong>Λούγαρο ή Σκαθί</strong> είναι στρουθιόμορφο πτηνό της οικογενείας των <strong>Σπιζιδών</strong>, που απαντά και στον ελλαδικό χώρο. Η επιστημονική ονομασία του είδους είναι <strong>Carduelis spinus και δεν περιλαμβάνει υποείδη.</strong>\n" +
                "\n" +
                "<br/><br/><strong>Σημειωτέον ότι, η λαϊκή ονομασία Σκαθί προέρχεται από την ομοιότητά του με το είδος Serinus serinus δηλαδή το κοινό μας σκαρθί ή οργανέλι και δεν πρέπει να συγχέεται με αυτό.</strong>\n" +
                "\n" +
                "<br/><br/><strong>Το εξαιρετικό κελάηδημά του, καθώς και η ανθεκτικότητά του σε συνθήκες αιχμαλωσίας,</strong> τού έχουν κοστίσει ακριβά, διότι είναι από τα πλέον «αγαπημένα» ωδικά πτηνά που ζουν σε κλουβιά, ιδιαίτερα στην Ελλάδα.\n" +
                "\n" +
                "<br/>Το λούγαρο, ανάλογα με την επικράτεια, μπορεί να απαντά είτε ως <strong>επιδημητικό</strong>, είτε ως <strong>μεταναστευτικό</strong> είδος.\n" +
                "\n" +
                "<br/>Γενικά πάντως, πρόκειται για πτηνό που δεν παραμένει για πολύ σε μια περιοχή, αλλά προτιμάει να εναλλάσσει τα εδάφη που χρησιμοποιούνται για αναπαραγωγή, διατροφή και διαχείμαση, κατά περιόδους.\n" +
                "\n" +
                "<br/>Σύμφωνα με την Αμερικανική Ορνιθολογική Ένωση, το είδος έχει παρατηρηθεί και στην Β. Αμερική, αλλά δεν υπάρχουν επαρκή δεδομένα για το, εάν πρόκειται για πραγματικούς «μετανάστες», ή για άτομα που έχουν ξεφύγει από αιχμαλωσία (ζωολογικούς κήπους, κλουβιά, κ.ο.κ.). Εάν ισχύει το πρώτο, το πουλί μπορεί να έφθασε στην Αμερική, είτε από την Ασία, είτε από την Ευρώπη (Γροιλανδία, Ισλανδία). Το σημαντικό σε αυτή την περίπτωση είναι, ότι αποτελεί το «πατρικό» είδος για τους υφιστάμενους πληθυσμούς Carduelis/Spinus της Βόρειας Αμερικής. Επίσης, έχει καταγραφεί τόσο στις Αλεούτιες Νήσους, όσο και στον Α. Καναδά. Αυτό αυξάνει την πιθανότητα ότι το πτηνό εισήλθε, ή εξακολουθεί να εισέρχεται στην Αμερική μέσω Δ.Ευρώπης.\n" +
                "\n" +
                "<br/>Εκτός από τις ΗΠΑ, τυχαίοι, περιπλανώμενοι επισκέπτες έχουν αναφερθεί μεταξύ άλλων από την Σαουδική Αραβία, το Μπαχρέιν, το Ομάν, το Νεπάλ και το Αφγανιστάν, το Χονγκ Κονγκ και τις Φιλιππίνες!!\n" +
                "\n" +
                "<br/><strong>Στην Ελλάδα,</strong> το λούγαρο απαντά κυρίως ως διαχειμάζον είδος (τέλη Οκτωβρίου-μέσα Μαρτίου) σε όλη την επικράτεια, <strong>ως μεταναστευτικό πτηνό</strong> κατά τις αποδημίες αλλά και στη βόρεια χώρα, όπου φαίνεται να παραμένει όλο το έτος και <strong>να φωλιάζει</strong> (Πίνδος, Ροδόπη). Ωστόσο, δεν αναφέρεται η παρουσία του -ως αναπαραγωγικό πτηνό- στο «Κόκκινο Βιβλίο των Απειλουμένων Σπονδυλοζώων της Ελλάδας». Επίσης, αναφέρεται και από την Κρήτη και ως χειμερινός επισκέπτης στην Κύπρο.\n" +
                "\n" +
                "<br/>Το κύριο ενδιαίτημα του είδους είναι οι δασικές εκτάσεις<strong> (κωνοφόρα, μικτά δάση) μέχρι ένα συγκεκριμένο υψόμετρο,</strong> κυρίως στις πλαγιές των βουνών, με<strong> ιδιαίτερη προτίμηση για τις υγρές περιοχές</strong> (όχθες ποταμών).Από τα δάση κωνοφόρων, απαντάται ιδιαίτερα σε εκείνα της ερυθρελάτης (Picea abies), για το φώλιασμα.\n" +
                "\n" +
                "<br/>Στην Ελλάδα το λούγαρο ανευρίσκεται<strong> σε δασικές αλλά και πεδινές εκτάσεις</strong>, με προτίμηση στα κωνοφόρα δάση κατά την αναπαραγωγική εποχή και άλση, φράκτες, συστάδες σημύδων και σκλήθρων, κατά τη διάρκεια του χειμώνα.\n" +
                "\n" +
                "<br/>Το λούγαρο <strong>είναι από τις κομψότερες σπίζες και χαρακτηρίζεται από το όμορφο κιτρινόμαυρο πτέρωμά του.</strong> Παρόλο που μπορεί -από κάποια απόσταση- να συγχέεται με τα συγγενικά του είδη, το αρσενικό ξεχωρίζει εύκολα διότι είναι η μόνη κίτρινη ευρωπαϊκή σπίζα με μαύρο στέμμα και μαύρη κηλίδα στο σαγόνι.\n" +
                "\n" +
                "<br/>Στο είδος εμφανίζεται φυλετικός διμορφισμός, με το αρσενικό να έχει φωτεινότερα χρώματα από το θηλυκό, ιδιαίτερα στην περιοχή του κεφαλιού.\n" +
                "\n" +
                "<br/><br/>Άλλες ονομασίες του είδους είναι: Σπίζα η ακανθυλλίς, Σπίζα η πρασίνη, Ακανθυλίς/Ακανθίς η πρασίνη και Ακανθυλλίς/Ακανθίς η χρυσοπράσινη, Λουγαράκι, Λουκαρίνο, Σκαθάρι, Σκαθί, Χρυσοκαρδερίνα, Αηδονάκι, Ζιζικάκι, Κιτρινάκι, Λουβαράκι, Λούβαρο, Λουγαρίνι, Μούλος, Μπαστοκάναρο και Σκαθάκι.\n" +
                "\n" +
                "Στην Κύπρο, η συνηθέστερη ονομασία του είναι Θκιολαρούδι.<br/><br/>Πληροφορίες από:<br/>https://el.wikipedia.org/','lougaro','ok')," +
         "('Φλώρος','Είναι ένα <strong>από τα πιο διαδεδομένα</strong> και συνάμα πιο " +
                "<strong>αγαπητά</strong> ωδικά πτηνά σε όλη την ευρωπη και ίσος σε όλη την υφήλιο. " +
                "Ο Φλώρος είναι στρουθιόμορφο πτηνό της οικογενείας των Σπιζιδών, που απαντάται και στον " +
                "ελλαδικό χώρο. Η επιστημονική ονομασία του είδους είναι <strong><i>Chloris chloris</i> </strong>" +
                "και περιλαμβάνει 10 υποείδη.Ο φλώρος είναι <strong>μέσου μεγέθους σπίζα,</strong> μεγαλύτερος " +
                "από το λούγαρο και την καρδερίνα, αλλά μικρότερος από τον σπίνο και τον πύρρουλα. " +
                "Γενικά, <strong>έχει στρουμπουλό παρουσιαστικό</strong>, με εύρωστο κεφάλι και ράμφος. " +
                "Ο φλώρος<strong> είναι από τα πλέον οικεία πτηνά στην χώρα,</strong> αναπαραγόμενος σε όλα τα " +
                "ηπειρωτικά και σε πολλά νησιά του Αιγαίου και του Ιονίου. " +
                "Απαντούν από το επίπεδο της θάλασσας μέχρι τα 1.200 μ., αλλά στην Κρήτη μπορούν να βρεθούν " +
                "μέχρι τα 1.600 μ. Τα βρίσκουμε σε άλση, κήπους, ελαιώνες, αμπέλια, καλλιεργούμενες περιοχές " +
                "στα δασοόρια, σε θαμνότοπους και ποταμιές. Γενικά, φωλιάζουν και σε αστικά περιβάλλοντα, " +
                "έχοντας συνηθίσει την ανθρώπινη παρουσία. Ο Φλώρος απαντά στον ελλαδικό χώρο και με τις " +
                "ονομασίες: Ατσάραντος (Στερεά, Ζάκυνθος), Λιναρίδι και Λιναροπούλι (Κρήτη), Πρασινοπούλα, " +
                "Σπιγγάρι και Σπιγγάριος (Αττική), Φιώρι, Φλώρι και Λουλουδάς (Κύπρος).','floros','ok')," +
         "('Φανέτο','Το<strong> Φανέτο</strong> είναι στρουθιόμορφο πτηνό της οικογενείας των Σπιζιδών " +
                "και είναι γνωστό με τις ονομασίες Κιόρι, Σκαθάρι, Φανέτα, Φαγανέλι ενώ στην Κύπρο είναι γνωστό" +
                " ως Τσακροσγάρτιλο.Είναι ένα μικρόσωμο σε μέγεθος πουλί που το συνολικό του μήκος δεν ξεπερνά" +
                " τα 14 εκατοστά. Σπάνια το συναντά κανείς μόνο του. Ζει σε κοπάδια όλο τον χειμώνα, ενώ κατά" +
                " την αναπαραγωγική περίοδο μένουν πάντα σε ζευγάρια.<br/><br/>Πληροφορίες από:<br/>https://el.wikipedia.org/','faneto','ok')," +
          "('Πετροχελίδονο','Το κοινό πετροχελίδονο, γνωστό επίσης ως μαυροσταχτάρα ή μαυροσταχτούρα, " +
                "ένα συνηθισμένο στην Ελλάδα πουλί, δεν είναι μόνο το ταχύτερο στη Γη, αλλά είναι η" +
                " «Φόρμουλα Ένα των αιθέρων» των πουλιών σε ευθεία πτήση (στις βουτιές είναι ο πετρίτης)." +
                "Παρατηρείται συνεχώς να κυνηγά έντομα στον αέρα, συχνά με χελιδόνια. Ξεχωρίζει από αυτά από το" +
                " σκούρο κάτω μέρος (μόνο ο λαιμός ανοιχτόχρωμος), λίγο μεγαλύτερο μέγεθος, διαφορετικό πέταγμα" +
                " και σχήμα φτερούγων.Ανακηρύχθηκε πλέον επίσημα από τους επιστήμονες ο παγκόσμιος πρωταθλητής " +
                "των αιθέρων, καθώς μπορεί να πετά συνεχόμενα επί δέκα μήνες χωρίς καμία στάση. Και βεβαίως, όλο" +
                " αυτό τον καιρό, κοιμάται και τρώει (έντομα) εν πτήση!" +
                "Ήδη από τη δεκαετία του 1950, οι επιστήμονες υποπτεύονταν ότι κανένα πουλί δεν μπορεί να " +
                "συναγωνισθεί το πετροχελίδονο στο πέταγμα, αλλά μόλις τώρα Σουηδοί ερευνητές κατάφεραν να το " +
                "επιβεβαιώσουν. Είναι πια βέβαιο ότι κανένα πουλί στον κόσμο δεν μπορεί να μείνει τόσο πολύ " +
                "καιρό στον αέρα χωρίς να προσγειωθεί. Καθώς το πετροχελίδονο ζει έως 20 χρόνια, συνολικά " +
                "στη διάρκεια της ζωής του πετά επτά φορές την απόσταση Γης-Σελήνης μετ’ επιστροφής." +
                "Αποδείχθηκε ότι το πετροχελίδονο -που εμφανισιακά μοιάζει με το χελιδόνι, αλλά ανήκουν σε " +
                "διαφορετικές οικογένειες πουλιών- περνά μόνο δύο μήνες του χρόνου στη γη, στη βόρεια Ευρώπη, " +
                "κατά την περίοδο της αναπαραγωγής του." +
                "Τον υπόλοιπο χρόνο πετάει, μεταναστεύοντας κυρίως στην Αφρική. Μερικά πουλιά μπορεί να " +
                "προσγειώνονται για λίγες ώρες κάποιο βράδυ, αλλά και αυτά περνούν το 99,5% του δεκαμήνου στον αέρα." +
                "Άλλα όμως δεν…κλέβουν καθόλου και παραμένουν συνεχώς εν πτήση." +
                "Ερώτημα παραμένει πού βρίσκουν την ενέργεια για τόσο μακρινά ταξίδια και πώς συνδυάζουν την πτήση " +
                "με τον ύπνο. Κάθε μέρα, την αυγή και το δειλινό, για άγνωστο λόγο, τα πετροχελίδονα ανεβαίνουν " +
                "σε μεγάλα ύψη, δύο έως τριών χιλιομέτρων, αλλά την υπόλοιπη μέρα πετάνε πιο χαμηλά. Ένα αγαπημένο " +
                "μέρος συγκέντρωσης αυτών των πουλιών στη μεταναστευτική διαδρομή τους είναι η Λιβερία, όπου κάθε " +
                "χρόνο πολλά εκατομμύρια πετροχελίδονα μαζεύονται για να κυνηγήσουν τερμίτες – " +
                "<br/>ένα μοναδικό θέαμα.<br/><br/>Πληροφορίες από:<br/>https://el.wikipedia.org/','petroxelidono','ok')," +
           "('Αετομάχος','Ωδικό πουλί με συμπεριφορά αρπακτικού, όπως όλοι οι κεφαλάδες. Kαλοκαιρινός επισκέπτης, φωλιάζει σε όλη την ηπειρωτική Ελλάδα και σε ορισμένα νησιά.\n" +
                "        Ο αρσενικός Αετομάχος έχει πυρόξανθο φτέρωμα στη ράχη του ενώ το πρόσωπό του αυλακώνεται από μια φαρδιά και χαρακτηριστική μαύρη λωρίδα. Ο λαιμός, τα μάγουλα και το φρύδι έχουν χρώμα λευκό.\n" +
                "\n" +
                "        Το θηλυκό, σε αντίθεση με τα αρσενικό δεν έχει γκρίζο κεφάλι, ούτε διαθέτει μαύρη μάσκα στο πρόσωπο. Η κορυφή του κεφαλιού είναι κοκκινωπή-καφέ, ενώ ο τράχηλος έχει πιο πολύ καφέ-γκρι χρώμα.\n" +
                "\n" +
                "        Στους αετομάχους εμφανίζεται έντονος φυλετικός διμορφισμός. Επίσης οι χρωματισμοί του πτερώματος διαφέρουν όχι μόνον ανάμεσα στα αρσενικά και τα θηλυκά, αλλά ακόμη και μέσα στο ίδιο φύλο και στον ίδιο αναπαραγωγικό πληθυσμό, εμφανίζοντας αξιοσημείωτη διαφοροποίηση.\n" +
                "\n" +
                "        Θα τον συναντήσουμε σε ανοιχτές περιοχές με θάμνους αλλά και σε ξέφωτα του δάσους, να καραδοκεί όχι μόνο για έντομα αλλά και για ποντίκια, βατράχια και μικρά πουλιά. Γεννάει 5-6 αβγά, τα οποία κλωσάει το θηλυκό επί 13-16 μέρες. Οι νεοσσοί δέχονται τη στοργική φροντίδα του ζευγαριού και κάνουν το πρώτα πετάγματα από τη φωλιά μετά από δύο εβδομάδες.\n" +
                "\n" +
                "        Το χαρακτηριστικό πρόσωπο του αετομάχου, η τόλμη του και, κυρίως η χαρακτηριστική του συνήθεια να «αποθηκεύει» τη λεία του καρφώνοντάς την πάνω σε αιχμηρά αντικείμενα, ανέκαθεν κινούσαν το ενδιαφέρον του επιστημονικού κόσμου και όχι μόνον.\n" +
                "\n" +
                "        Η τεχνική της αναμονής από σταθερό πόστο, κατά κύριο λόγο χρησιμοποιείται για το κυνήγι μικρών θηλαστικών, αλλά και σε έντομα όπως σκαθάρια και ακρίδες. Η επίθεση στο θήραμα πραγματοποιείται στο έδαφος και σε απόσταση 10 μέτρων, περίπου, από το πόστο.\n" +
                "\n" +
                "        Το κυριότερο από τα στοιχεία ηθολογίας του αετομάχου όπως είπαμε προηγουμένως, αποτελεί η ενστικτώδης συνήθειά του να «αποθηκεύει» τη λεία του για τις δύσκολες εποχές, αλλά με έναν πολύ ιδιαίτερο τρόπο: το πουλί καρφώνει στην κυριολεξία το νεκρό θήραμα πάνω σε οποιοδήποτε αιχμηρό υπάρχει στην περιοχή όπου συχνάζει, συνήθως πάνω στα μεγάλα αγκάθια των θάμνων, ή πάνω στις αιχμηρές ακίδες συρματοπλεγμάτων από τους εκεί φράκτες.\n" +
                "\n" +
                "        Στην κατασκευή της φωλιάς συμμετέχουν και τα δύο φύλα, κυρίως όμως το θηλυκό και ολοκληρώνεται μετά από 4-6 ημέρες, περίπου.\n" +
                "\n" +
                "        Οι κυριότεροι θηρευτές της φωλιάς του αετομάχου είναι τα αρπακτικά πτηνά, ιδιαίτερα οι Κορακίδες (κίσσες και καρακάξες), πιο σπάνια κάποια θηλαστικά, όπως γάτες, μουστελίδες και τρωκτικά. Σε σπάνιες περιπτώσεις η φωλιά καταστρέφεται από μυρμήκια.\n" +
                "\n" +
                "        Η IUCN, προς το παρόν κατατάσσει το είδος ως «Ελαχίστης Ανησυχίας» (LC), αλλά σε αρκετά ευρωπαϊκά κράτη το είδος απειλείται, τουλάχιστον ως αναπαραγωγικό πτηνό.\n" +
                "\n" +
                "        Στον ελλαδικό χώρο o Αετομάχος απαντά και με τις ονομασίες: Αητομάχος (Παρνασσός), Δαγκάνι (Λεσίνι Αιτωλίας), " +
                "Δάγκος, Κρεουργός, Λιάρος, Μαυρομμάτης, Μουροχάβης, Κοκκινοραχοκεφαλάς και Μαυροκεφαλάς. Τέλος, στην Κυπρο " +
                "αποκαλείται Στακτοτζεφαλάς.<br/><br/>" +
                "Πληροφορίες από:<br/>https://el.wikipedia.org/','aetomaxos','ok');";

        //('','','','ok')


    return query;

    }

}
