package gr.odikapoulia.greekbirds;

/**
 * Created by nikos on 1/3/18.
 */

public class QueryInsert {

    String query;
    public String QueryInsert(){

        query = "INSERT INTO birdlist (Birdname,BirdInfo, Photo, Result) VALUES " +
                "('Καρδερίνα','Η<strong> καρδερίνα</strong> είναι στρουθιόμορφο πτηνό, του γένους Carduelis και ανήκει στην οικογένεια των σπιζιδών. Είναι ωδικό πτηνό και <strong>ζει κατά σμήνη σε δάση και σε λιβάδια,</strong> όπως επίσης σε κήπους και σε αγρούς.<br/><br/>" +
                " Είναι αποδημητικό πουλί και το φθινόπωρο<strong> μεταναστεύει σε τόπους με πιο γλυκό κλίμα</strong>. <strong>Τρέφεται</strong> σχεδόν αποκλειστικά <strong>με σπόρους αγκαθιών και με σκουλήκια</strong>. Αξιοσημείωτη είναι η αλληλεγγύη και η αγάπη που τρέφουν τα πουλιά αυτά μεταξύ τους.<br/><br/>Το μήκος του πτηνού φθάνει τα <strong>19 εκατοστά και υπάρχει μεγάλη ποικιλία σε χρωματικούς συνδυασμούς</strong>. Κυρίαρχα χρώματα είναι το<strong> κίτρινο, το κόκκινο και το μαύρο</strong>. Το κεφάλι της έχει χρώμα κόκκινο και σε αυτό το χαρακτηριστικό οφείλεται η ονομασία \"τουρκοπούλα\" που της έδωσε ο λαός, επειδή το κόκκινο χρώμα στο κεφάλι της μοιάζει σαν<strong> το πτηνό να φορά φέσι.</strong><br/><br/>\n" +
                "\n" +
                "Οι <strong>αρσενικές</strong> καρδερίνες έχουν<strong> πιο έντονα χρώματα πιο σκούρα τα μαύρα σημεία τους.</strong> Θα πρέπει ένας νέος εκτροφέας να προσέξει την φτερούγα του αρσενικού πτηνού να είναι όλη μαύρη ,η κόκκινη μάσκα στο κεφάλι να φτάνει μέχρι πίσω από τα μάτια της, τα μουστάκια ή τρίχες δηλαδή γύρω από το ράμφος της να είναι μαύρα και αυτά. Στο κεφάλι της το μαύρο τμήμα είναι ομοιόμορφο δίχως άσπρες τρίχες.<br/><br/>\n" +
                "\n" +
                "Στα μικρά πτηνά τα <strong>οποία δεν έχουν ντυθεί ακόμα</strong> μπορούμε και εκεί να τα ξεχωρίζουμε από την μαύρη φτερούγα και από το<strong> μαύρο μουστάκι.</strong> Όμως πολλές φορές μπορεί να γελαστούμε στα νεαρά πτηνά διότι υπάρχουν μερικές καρδερίνες <strong>που δεν μπορούμε να της ξεχωρίσουμε απόλυτα.</strong><br/><br/>\n" +
                "\n" +
                "Οι <strong>θηλυκές</strong> καρδερίνες έχουν <strong>πιο ξεθωριασμένα χρώματα</strong> η κόκκινη μάσκα δεν καλύπτει το μάτι αλλά μέχρι την μέση του περίπου . Η φτερούγα της είναι καφέ, στο κεφάλι της στο μαύρο τμήμα έχει άσπρα φτερά, στο μουστάκι της έχει καφέ τρίχες και γενικότερα <strong>είναι μικρότερη σε μέγεθος από την αρσενική.</strong><br/><br/>\n" +
                "\n" +
                "Οι μικρές θηλυκές καρδερίνες έχουν και αυτές <strong>καφέ φτερούγες και καφέ φτερά γύρω από το ράμφος τους.</strong><br/><br/>\n" +
                "\n" +
                "Η καρδερίνα ζευγαρώνει την άνοιξη και κτίζει φωλιά σε κορυφές των δέντρων, Στο χώρο αυτό γεννά 4-5 αυγά χρώματος γαλαζοπράσινου με καστανά στίγματα και τα επωάζει επί 14 ημέρες περίπου, ενώ το αρσενικό επιμελείται τη διασκέδασή της με το κελάηδημά του. Γενικά, είναι πολύ στοργικό πουλί απέναντι στα μικρά του.<br/><br/>\n" +
                "\n" +
                "Οι καρδερίνες λόγω της ευρείας ποικιλίας χρωμάτων και ιδίως φωνών <strong>τράβηξαν την προσοχή εκατοντάδων εκτροφέων</strong> εκ των οποίων άλλοι ασχολήθηκαν με χρωματικές μεταλλάξεις ενώ ορισμένοι με βελτιώσεις των φωνών. Έτσι οι πιο γνώστες ράτσες καρδερινών οι οποίες υπάρχουν στην φύση είναι:<br/>\n" +
                "\n" +
                "<strong>Η αρχέγονη καρδερινα</strong> (Carduelis carduelis) ,στα Βαλκάνια ενα ιδιαίτερο υποείδος της είναι η γνώστη σε όλους μας ελληνική καρδερίνα η όποια εκτείνεται σε όλα τα Βαλκάνια γνωστη και ως carduelis carduelis <strong>balcanica</strong><br/>\n" +
                "\n" +
                "Ωστόσο υπάρχουν και αξιόλογες μεταλλάξεις καρδερινων οι οποίες δημιουργήθηκαν με την ελεγχόμενη και επιλεκτική διασταύρωση καρδερινων οι πιο διαδεδομένες είναι οι:<br/>\n" +
                "\n" +
                "<strong>Καρδερίνα Major</strong> (Carduelis carduelis Major)<strong> ή καρδερίνα Σιβηρίας</strong> η όποια ωστόσο υστερεί φωνητικά ,\n" +
                "καρδερίνα Αχάτης , καρδερίνα Ασπροκέφαλη καθώς και ιζαμπελα.<br/><br/>\n" +
                "\n" +
                "Υπάρχουν <strong>διάφορα ονόματα για την καρδερίνα.</strong> Η επιστημονική της ονομασία είναι σπίζα η ακανθοφάγος ή ακανθυλίδα η γνήσια.<br/>\n" +
                "\n" +
                "Αστραγαλίνος ή Στραγαλιάνος ή Στραγαλίνι<br/>\n" +
                "Γαρδέλι.\n" +
                "Γραμματικούλα.<br/>\n" +
                "Τουρκοπούλα: ( ή Τουρκάκι στην Λακωνία) από το κόκκινο στο κεφάλι της, που μοιάζει με φέσι.<br/>\n" +
                "Σγαρτήλι (Κυπριακή διάλεκτος)','karderina','ok')," +
        "('Καναρίνι','Το <strong>καναρίνι</strong> είναι ωδικό πτηνό της τάξης των<strong> στρουθιομόρφων και ανήκει στην οικογένεια των φριγγιλιδών</strong> (Fringillidae). Η επίσημη ονομασία του εξημερωμένου καναρινιού είναι <strong>sirinus canaria domesticus.</strong><br/><br/>\n" +
                "\n" +
                "Τα καναρίνια εισήχθησαν στην Ισπανία τον 15ο αι. μετά την κατάκτηση των Κανάριων νήσων από τους Ισπανούς. Εξαιτίας ενός<strong> ναυτιλιακού ατυχήματος ένα μεγάλο φορτίο καναρινιών δραπέτευσε και σύντομα εξαπλώθηκαν σε όλη την Ευρώπη</strong>. Επίσης το καναρίνι είναι πιθανό να προέρχεται και από το άγριο καναρίνι (serinus canaria canaria), το οποίο κατάγεται από τις Κανάριες νήσους Μαδέρα, Αζόρες, Τενερίφη κ.α.<br/><br/>\n" +
                "\n" +
                "Τα καναρίνια <strong>διακρίνονται σε τρεις μεγάλες κατηγορίες:</strong><br/>\n" +
                "\n" +
                "Τα <strong>ολλανδικά</strong> καναρίνια. Είναι μεγάλα, έχουν μαλακό φτέρωμα, αλλά δεν διακρίνοται για το κελάηδημά τους.<br/>\n" +
                "Τα <strong>γερμανικά</strong> καναρίνια. Έχουν ωραίο χρώμα και ωραία φωνή.<br/>\n" +
                "Τα <strong>αγγλικά</strong> καναρίνια.<br/> Έχουν χρώμα κίτρινο σκούρο που μεταβάλλεται όμως σε κιτρινο-κόκκινο ή κοκκινο-πορτοκαλί, εξαιτίας της τεχνητής τροφής που αποτελείται από πιπέρι, ζάχαρη, αλεύρι και βρασμένο αυγό.<br/><br/>\n" +
                "\n" +
                "Ορισμένες χώρες εκτρέφουν καναρίνια <strong>για το κελάηδημά τους ενώ άλλες για το χρώμα τους.</strong> Υπάρχουν διάφορα είδη καναρινιών τα οποία ομαδοποιούνται σε ξεχωριστές κατηγορίες σύμφωνα με τα ιδιαίτερα χαρακτηριστικά τους.\n" +
                "\n" +
                "Έτσι κατηγοριοποιούνται βάσει του διαφορετικού κελαδήματος τους, του διαφορετικού χρωματισμού τους και της διαφορετικής τους εξωτερικής εμφάνισης τους με σκουφί η χωρίς, σγουρά κ.α. Σε αυτές ανήκει και το άγριο καναρίνι.<br/><br/>\n" +
                "\n" +
                "Έχει<strong> πράσινο φτέρωμα με γκρίζες ραβδώσεις και με κίτρινες αποχρώσεις στο κεφάλι και στη ράχη</strong>. Μπορεί να ζευγαρώσει εύκολα με την καρδερίνα, το σκαρθί, το φλυτζούνι κτλ. Στην ανατολική μεσόγειο ζούσε ένα άλλο είδος καναρινιού, το οικόσιτο, το οποίο προέρχεται από το άγριο καναρίνι και είχε αρχίσει να εισάγεται στην Ευρώπη στα τέλη του 16ου αιώνα.<br/><br/>\n" +
                "\n" +
                "Τα διάφορα είδη καναρινιών που υπάρχουν σήμερα προέρχονται από <strong>διασταυρώσεις και μεταλλαγές από τους εκτροφείς.</strong> Στο Μαλίν εκτρέφουν οι κάτοικοι της περιοχής ένα άλλο μελωδικό καναρίνι το μαλινουά, που διαθέτει μεταλλικές νότες, μεσαίες και υψηλές καθώς νεροφωνές και αηδονοφωνές κ.α.<br/><br/>\n" +
                "\n" +
                "Στην Αγγλία διασταυρώνουν παλιές φυλές καναρινιών και δημιουργούν<strong> νέα μεγαλόσωμα καναρίνια που παίρνουν το όνομα τους από τις ομώνυμες πόλεις στις οποίες δημιουργήθηκαν.</strong> Στην Γαλλία το σγουρό καναρίνι από το Παρίσι, στο Βέλγιο το χαρακτηριστικό καμπούρικο καναρίνι και πολλά άλλα σε διάφορες χώρες και περιοχές. Ονομαστά για το κελαηδημά τους είναι τα καναρίνια του Χαρτς.<br/><br/>\n" +
                "\n" +
                "Τα καναρίνια <strong>είναι καθαρά, ήρεμα και δεν χρειάζονται ιδιαίτερη φροντίδα·</strong> δεν τους αρέσει όμως να τα αγγίζει κάποιος. Ο μελωδικός και ευχάριστος ήχος που βγάζουν όταν τραγουδάνε <strong>είναι το ιδιαίτερο χαρακτηριστικό τους</strong>. <strong>Από τους πρώτους μήνες της ζωής τους, κυρίως τα αρσενικά, αρχίζουν να κελαηδούν.</strong> Τα καναρίνια έχουν μάθει να ζουν μέσα στο κλουβί και γιαυτό δεν φημίζονται ως κοινωνικά πουλιά. Η ζωή τους είναι ευχάριστη μέσα στο κλουβί. Για καλύτερη επιβίωση των καναρινιών τα αρσενικά θα πρέπει να βρίσκονται σε ξεχωριστά κλουβιά από τα θηλυκά για να αποφύγουμε τυχόν συγκρούσεις. Για να έχουν όμως παρέα, τα κλουβιά είναι καλό να βρίσκονται σε κοντινή απόσταση.<br/><br/>\n" +
                "\n" +
                "Δεν είναι εύκολο να ξεχωρίσουμε το φύλο των καναρινιών. Κατά την περίοδο αναπαραγωγής όμως, μπορούμε από την συμπεριφορά, να το διακρίνουμε πιο εύκολα. Εκείνη την περίοδο που είναι συνήθως την άνοιξη, τα αρσενικά είναι <strong>ιδιαίτερα ομιλητικά.</strong><br/><br/>\n" +
                "\n" +
                "Τα καναρίνια είναι σχετικά εύκολο να αναπαραχθούν στο σπίτι αρκεί:<br/>\n" +
                "\n" +
                "να είναι υγιή και ενήλικα<br/>\n" +
                "να υπάρχει άφθονο νερό και φαγητό<br/>\n" +
                "μια φωλιά και υλικά για να τοποθετήσουν μέσα στη φωλιά.<br/>','kanarini','ok')," +
                "('Λούγαρο ή Σκαθί','Το <strong>Λούγαρο ή Σκαθί</strong> είναι στρουθιόμορφο πτηνό της οικογενείας των <strong>Σπιζιδών</strong>, που απαντά και στον ελλαδικό χώρο. Η επιστημονική ονομασία του είδους είναι <strong>Carduelis spinus και δεν περιλαμβάνει υποείδη.</strong><br/><br/>\n" +
                "\n" +
                "<strong>Το εξαιρετικό κελάηδημά του, καθώς και η ανθεκτικότητά του σε συνθήκες αιχμαλωσίας,</strong> τού έχουν κοστίσει ακριβά, διότι είναι από τα πλέον «αγαπημένα» ωδικά πτηνά που ζουν σε κλουβιά, ιδιαίτερα στην Ελλάδα.<br/><br/>\n" +
                "\n" +
                "Το λούγαρο, ανάλογα με την επικράτεια, μπορεί να απαντά είτε ως <strong>επιδημητικό</strong>, είτε ως <strong>μεταναστευτικό</strong> είδος.<br/><br/>\n" +
                "\n" +
                "Γενικά πάντως, πρόκειται για πτηνό που δεν παραμένει για πολύ σε μια περιοχή, αλλά προτιμάει να εναλλάσσει τα εδάφη που χρησιμοποιούνται για αναπαραγωγή, διατροφή και διαχείμαση, κατά περιόδους.<br/><br/>\n" +
                "\n" +
                "Σύμφωνα με την Αμερικανική Ορνιθολογική Ένωση, το είδος έχει παρατηρηθεί και στην Β. Αμερική, αλλά δεν υπάρχουν επαρκή δεδομένα για το, εάν πρόκειται για πραγματικούς «μετανάστες», ή για άτομα που έχουν ξεφύγει από αιχμαλωσία (ζωολογικούς κήπους, κλουβιά, κ.ο.κ.). Εάν ισχύει το πρώτο, το πουλί μπορεί να έφθασε στην Αμερική, είτε από την Ασία, είτε από την Ευρώπη (Γροιλανδία, Ισλανδία). Το σημαντικό σε αυτή την περίπτωση είναι, ότι αποτελεί το «πατρικό» είδος για τους υφιστάμενους πληθυσμούς Carduelis/Spinus της Βόρειας Αμερικής. Επίσης, έχει καταγραφεί τόσο στις Αλεούτιες Νήσους, όσο και στον Α. Καναδά. Αυτό αυξάνει την πιθανότητα ότι το πτηνό εισήλθε, ή εξακολουθεί να εισέρχεται στην Αμερική μέσω Δ.Ευρώπης.<br/><br/>\n" +
                "\n" +
                "Εκτός από τις ΗΠΑ, τυχαίοι, περιπλανώμενοι επισκέπτες έχουν αναφερθεί μεταξύ άλλων από την Σαουδική Αραβία, το Μπαχρέιν, το Ομάν, το Νεπάλ και το Αφγανιστάν, το Χονγκ Κονγκ και τις Φιλιππίνες!!<br/><br/>\n" +
                "\n" +
                "<strong>Στην Ελλάδα,</strong> το λούγαρο απαντά κυρίως ως διαχειμάζον είδος (τέλη Οκτωβρίου-μέσα Μαρτίου) σε όλη την επικράτεια, <strong>ως μεταναστευτικό πτηνό</strong> κατά τις αποδημίες αλλά και στη βόρεια χώρα, όπου φαίνεται να παραμένει όλο το έτος και <strong>να φωλιάζει</strong> (Πίνδος, Ροδόπη). Ωστόσο, δεν αναφέρεται η παρουσία του -ως αναπαραγωγικό πτηνό- στο «Κόκκινο Βιβλίο των Απειλουμένων Σπονδυλοζώων της Ελλάδας». Επίσης, αναφέρεται και από την Κρήτη και ως χειμερινός επισκέπτης στην Κύπρο.<br/><br/>\n" +
                "\n" +
                "Το κύριο ενδιαίτημα του είδους είναι οι δασικές εκτάσεις<strong> (κωνοφόρα, μικτά δάση) μέχρι ένα συγκεκριμένο υψόμετρο,</strong> κυρίως στις πλαγιές των βουνών, με<strong> ιδιαίτερη προτίμηση για τις υγρές περιοχές</strong> (όχθες ποταμών).Από τα δάση κωνοφόρων, απαντάται ιδιαίτερα σε εκείνα της ερυθρελάτης (Picea abies), για το φώλιασμα.<br/><br/>\n" +
                "\n" +
                "Στην Ελλάδα το λούγαρο ανευρίσκεται<strong> σε δασικές αλλά και πεδινές εκτάσεις</strong>, με προτίμηση στα κωνοφόρα δάση κατά την αναπαραγωγική εποχή και άλση, φράκτες, συστάδες σημύδων και σκλήθρων, κατά τη διάρκεια του χειμώνα.<br/><br/>\n" +
                "\n" +
                "Το λούγαρο <strong>είναι από τις κομψότερες σπίζες και χαρακτηρίζεται από το όμορφο κιτρινόμαυρο πτέρωμά του.</strong> Παρόλο που μπορεί -από κάποια απόσταση- να συγχέεται με τα συγγενικά του είδη, το αρσενικό ξεχωρίζει εύκολα διότι είναι η μόνη κίτρινη ευρωπαϊκή σπίζα με μαύρο στέμμα και μαύρη κηλίδα στο σαγόνι.<br/><br/>\n" +
                "\n" +
                "Στο είδος εμφανίζεται φυλετικός διμορφισμός, με το αρσενικό να έχει φωτεινότερα χρώματα από το θηλυκό, ιδιαίτερα στην περιοχή του κεφαλιού.','lougaro','ok')," +
                "('Φλώρος','Είναι ένα <strong>από τα πιο διαδεδομένα</strong> και συνάμα πιο " +
                "<strong>αγαπητά</strong> ωδικά πτηνά σε όλη την ευρωπη και ίσος σε όλη την υφήλιο. " +
                "Ο Φλώρος είναι στρουθιόμορφο πτηνό της οικογενείας των Σπιζιδών, που απαντάται και στον " +
                "ελλαδικό χώρο. Η επιστημονική ονομασία του είδους είναι <strong><i>Chloris chloris</i> </strong>" +
                "και περιλαμβάνει 10 υποείδη.Ο φλώρος είναι <strong>μέσου μεγέθους σπίζα,</strong> μεγαλύτερος " +
                "από το λούγαρο και την καρδερίνα, αλλά μικρότερος από τον σπίνο και τον πύρρουλα. " +
                "Γενικά, <strong>έχει στρουμπουλό παρουσιαστικό</strong>, με εύρωστο κεφάλι και ράμφος. " +
                "Ο φλώρος<strong> είναι από τα πλέον οικεία πτηνά στην χώρα,</strong> αναπαραγόμενος σε όλα τα " +
                "ηπειρωτικά και σε πολλά νησιά του Αιγαίου και του Ιονίου. " +
                "Απαντούν από το επίπεδο της θάλασσας μέχρι τα 1.200 μ., αλλά στην Κρήτη μπορούν να βρεθούν " +
                "μέχρι τα 1.600 μ. Τα βρίσκουμε σε άλση, κήπους, ελαιώνες, αμπέλια, καλλιεργούμενες περιοχές " +
                "στα δασοόρια, σε θαμνότοπους και ποταμιές. Γενικά, φωλιάζουν και σε αστικά περιβάλλοντα, " +
                "έχοντας συνηθίσει την ανθρώπινη παρουσία. Ο Φλώρος απαντά στον ελλαδικό χώρο και με τις " +
                "ονομασίες: Ατσάραντος (Στερεά, Ζάκυνθος), Λιναρίδι και Λιναροπούλι (Κρήτη), Πρασινοπούλα, " +
                "Σπιγγάρι και Σπιγγάριος (Αττική), Φιώρι, Φλώρι και Λουλουδάς (Κύπρος).','floros','ok')," +
                "('Φανέτο','Το<strong> Φανέτο</strong> είναι στρουθιόμορφο πτηνό της οικογενείας των Σπιζιδών " +
                "και είναι γνωστό με τις ονομασίες Κιόρι, Σκαθάρι, Φανέτα, Φαγανέλι ενώ στην Κύπρο είναι γνωστό" +
                " ως Τσακροσγάρτιλο.Είναι ένα μικρόσωμο σε μέγεθος πουλί που το συνολικό του μήκος δεν ξεπερνά" +
                " τα 14 εκατοστά. Σπάνια το συναντά κανείς μόνο του. Ζει σε κοπάδια όλο τον χειμώνα, ενώ κατά" +
                " την αναπαραγωγική περίοδο μένουν πάντα σε ζευγάρια.','faneto','ok')," +
                "('Πετροχελίδονο','Το κοινό πετροχελίδονο, γνωστό επίσης ως μαυροσταχτάρα ή μαυροσταχτούρα, " +
                "ένα συνηθισμένο στην Ελλάδα πουλί, δεν είναι μόνο το ταχύτερο στη Γη, αλλά είναι η" +
                " «Φόρμουλα Ένα των αιθέρων» των πουλιών σε ευθεία πτήση (στις βουτιές είναι ο πετρίτης)." +
                "Παρατηρείται συνεχώς να κυνηγά έντομα στον αέρα, συχνά με χελιδόνια. Ξεχωρίζει από αυτά από το" +
                " σκούρο κάτω μέρος (μόνο ο λαιμός ανοιχτόχρωμος), λίγο μεγαλύτερο μέγεθος, διαφορετικό πέταγμα" +
                " και σχήμα φτερούγων.Ανακηρύχθηκε πλέον επίσημα από τους επιστήμονες ο παγκόσμιος πρωταθλητής " +
                "των αιθέρων, καθώς μπορεί να πετά συνεχόμενα επί δέκα μήνες χωρίς καμία στάση. Και βεβαίως, όλο" +
                " αυτό τον καιρό, κοιμάται και τρώει (έντομα) εν πτήση!" +
                "Ήδη από τη δεκαετία του 1950, οι επιστήμονες υποπτεύονταν ότι κανένα πουλί δεν μπορεί να " +
                "συναγωνισθεί το πετροχελίδονο στο πέταγμα, αλλά μόλις τώρα Σουηδοί ερευνητές κατάφεραν να το " +
                "επιβεβαιώσουν. Είναι πια βέβαιο ότι κανένα πουλί στον κόσμο δεν μπορεί να μείνει τόσο πολύ " +
                "καιρό στον αέρα χωρίς να προσγειωθεί. Καθώς το πετροχελίδονο ζει έως 20 χρόνια, συνολικά " +
                "στη διάρκεια της ζωής του πετά επτά φορές την απόσταση Γης-Σελήνης μετ’ επιστροφής." +
                "Αποδείχθηκε ότι το πετροχελίδονο -που εμφανισιακά μοιάζει με το χελιδόνι, αλλά ανήκουν σε " +
                "διαφορετικές οικογένειες πουλιών- περνά μόνο δύο μήνες του χρόνου στη γη, στη βόρεια Ευρώπη, " +
                "κατά την περίοδο της αναπαραγωγής του." +
                "Τον υπόλοιπο χρόνο πετάει, μεταναστεύοντας κυρίως στην Αφρική. Μερικά πουλιά μπορεί να " +
                "προσγειώνονται για λίγες ώρες κάποιο βράδυ, αλλά και αυτά περνούν το 99,5% του δεκαμήνου στον αέρα." +
                "Άλλα όμως δεν…κλέβουν καθόλου και παραμένουν συνεχώς εν πτήση." +
                "Ερώτημα παραμένει πού βρίσκουν την ενέργεια για τόσο μακρινά ταξίδια και πώς συνδυάζουν την πτήση " +
                "με τον ύπνο. Κάθε μέρα, την αυγή και το δειλινό, για άγνωστο λόγο, τα πετροχελίδονα ανεβαίνουν " +
                "σε μεγάλα ύψη, δύο έως τριών χιλιομέτρων, αλλά την υπόλοιπη μέρα πετάνε πιο χαμηλά. Ένα αγαπημένο " +
                "μέρος συγκέντρωσης αυτών των πουλιών στη μεταναστευτική διαδρομή τους είναι η Λιβερία, όπου κάθε " +
                "χρόνο πολλά εκατομμύρια πετροχελίδονα μαζεύονται για να κυνηγήσουν τερμίτες – <br/>ένα μοναδικό θέαμα.','petroxelidono','ok')," +
                "('Αετομάχος','Ωδικό πουλί με συμπεριφορά αρπακτικού, όπως όλοι οι κεφαλάδες. Kαλοκαιρινός επισκέπτης, φωλιάζει σε όλη την ηπειρωτική Ελλάδα και σε ορισμένα νησιά.\n" +
                "        Ο αρσενικός Αετομάχος έχει πυρόξανθο φτέρωμα στη ράχη του ενώ το πρόσωπό του αυλακώνεται από μια φαρδιά και χαρακτηριστική μαύρη λωρίδα. Ο λαιμός, τα μάγουλα και το φρύδι έχουν χρώμα λευκό.\n" +
                "\n" +
                "        Το θηλυκό, σε αντίθεση με τα αρσενικό δεν έχει γκρίζο κεφάλι, ούτε διαθέτει μαύρη μάσκα στο πρόσωπο. Η κορυφή του κεφαλιού είναι κοκκινωπή-καφέ, ενώ ο τράχηλος έχει πιο πολύ καφέ-γκρι χρώμα.\n" +
                "\n" +
                "        Στους αετομάχους εμφανίζεται έντονος φυλετικός διμορφισμός. Επίσης οι χρωματισμοί του πτερώματος διαφέρουν όχι μόνον ανάμεσα στα αρσενικά και τα θηλυκά, αλλά ακόμη και μέσα στο ίδιο φύλο και στον ίδιο αναπαραγωγικό πληθυσμό, εμφανίζοντας αξιοσημείωτη διαφοροποίηση.\n" +
                "\n" +
                "        Θα τον συναντήσουμε σε ανοιχτές περιοχές με θάμνους αλλά και σε ξέφωτα του δάσους, να καραδοκεί όχι μόνο για έντομα αλλά και για ποντίκια, βατράχια και μικρά πουλιά. Γεννάει 5-6 αβγά, τα οποία κλωσάει το θηλυκό επί 13-16 μέρες. Οι νεοσσοί δέχονται τη στοργική φροντίδα του ζευγαριού και κάνουν το πρώτα πετάγματα από τη φωλιά μετά από δύο εβδομάδες.\n" +
                "\n" +
                "        Το χαρακτηριστικό πρόσωπο του αετομάχου, η τόλμη του και, κυρίως η χαρακτηριστική του συνήθεια να «αποθηκεύει» τη λεία του καρφώνοντάς την πάνω σε αιχμηρά αντικείμενα, ανέκαθεν κινούσαν το ενδιαφέρον του επιστημονικού κόσμου και όχι μόνον.\n" +
                "\n" +
                "        Η τεχνική της αναμονής από σταθερό πόστο, κατά κύριο λόγο χρησιμοποιείται για το κυνήγι μικρών θηλαστικών, αλλά και σε έντομα όπως σκαθάρια και ακρίδες. Η επίθεση στο θήραμα πραγματοποιείται στο έδαφος και σε απόσταση 10 μέτρων, περίπου, από το πόστο.\n" +
                "\n" +
                "        Το κυριότερο από τα στοιχεία ηθολογίας του αετομάχου όπως είπαμε προηγουμένως, αποτελεί η ενστικτώδης συνήθειά του να «αποθηκεύει» τη λεία του για τις δύσκολες εποχές, αλλά με έναν πολύ ιδιαίτερο τρόπο: το πουλί καρφώνει στην κυριολεξία το νεκρό θήραμα πάνω σε οποιοδήποτε αιχμηρό υπάρχει στην περιοχή όπου συχνάζει, συνήθως πάνω στα μεγάλα αγκάθια των θάμνων, ή πάνω στις αιχμηρές ακίδες συρματοπλεγμάτων από τους εκεί φράκτες.\n" +
                "\n" +
                "        Στην κατασκευή της φωλιάς συμμετέχουν και τα δύο φύλα, κυρίως όμως το θηλυκό και ολοκληρώνεται μετά από 4-6 ημέρες, περίπου.\n" +
                "\n" +
                "        Οι κυριότεροι θηρευτές της φωλιάς του αετομάχου είναι τα αρπακτικά πτηνά, ιδιαίτερα οι Κορακίδες (κίσσες και καρακάξες), πιο σπάνια κάποια θηλαστικά, όπως γάτες, μουστελίδες και τρωκτικά. Σε σπάνιες περιπτώσεις η φωλιά καταστρέφεται από μυρμήκια.\n" +
                "\n" +
                "        Η IUCN, προς το παρόν κατατάσσει το είδος ως «Ελαχίστης Ανησυχίας» (LC), αλλά σε αρκετά ευρωπαϊκά κράτη το είδος απειλείται, τουλάχιστον ως αναπαραγωγικό πτηνό.\n" +
                "\n" +
                "        Στον ελλαδικό χώρο o Αετομάχος απαντά και με τις ονομασίες: Αητομάχος (Παρνασσός), Δαγκάνι (Λεσίνι Αιτωλίας), Δάγκος, Κρεουργός, Λιάρος, Μαυρομμάτης, Μουροχάβης, Κοκκινοραχοκεφαλάς και Μαυροκεφαλάς. Τέλος, στην Κυπρο αποκαλείται Στακτοτζεφαλάς.','aetomaxos','ok');";


    return query;

    }

}
